{
  "HB9": {
    "bill_number": "HB9",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB9",
    "status": "In Committee",
    "summary": "Time zone; permanent daylight saving time in the  Commonwealth. Provides that the Commonwealth shall observe Eastern Daylight  Time (Eastern Standard Time, advanced one hour) year-round upon the enactment  by Congress of a law allowing states to observe Eastern Daylight Time  year-round.",
    "last_action": "Referred to Committee on Rules",
    "last_action_date": "12/19/2025",
    "patron": "McNamara"
  },
  "SB10": {
    "bill_number": "SB10",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/SB10",
    "status": "In Committee",
    "summary": "Employment prohibition exceptions; apprenticeships;  children 16 years of age or older. Permits a child 16 years of age or older  to serve in an apprenticeship program or other  work-based learning experience, provided that the child (i)  is an apprentice registered pursuant to relevant law; (ii) is employed in a  work-training program administered pursuant to relevant law; or (iii) has obtained an industry certification, license, or  other verifiable proof of competency for the work being performed.",
    "last_action": "Referred to Committee on Commerce and Labor",
    "last_action_date": "11/17/2025",
    "patron": "Suetterlein"
  },
  "SB33": {
    "bill_number": "SB33",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/SB33",
    "status": "Pending",
    "summary": "Programs for at-risk students; permissible uses of funding. Includes as covered programs that are eligible for funding under the At-Risk Program initiatives to support both the physical and mental health of students in public schools, including the hiring of registered nurses and advanced practice registered nurses. The bill is a recommendation of the School Health Services Committee.",
    "last_action": "Assigned Education sub: Public Education",
    "last_action_date": "1/15/2026",
    "patron": "Favola"
  }
}