{
  "HB202": {
    "bill_number": "HB202",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB202",
    "status": "In Committee",
    "summary": "Prohibited acquisition of single-family  homes; affidavit; civil penalty. Restricts any partnership, corporation, or  real estate investment trust that manages funds pooled from investors, is a fiduciary to such investors, has net value or assets under management on any day  during a taxable year, and holds an interest in more  than 50 single-family homes from acquiring any  interest in any other single-family home, as defined in the bill to include  manufactured home parks and residential single-family homes  split into multiple dwellings, on or after July 1, 2026. The bill also  requires an offering purchaser of a manufactured home park to provide a  notarized affidavit certifying that the purchaser is not prohibited from  acquiring such an interest. Any false statements on  such affidavit is subject to a civil penalty of up  to $10,000 per occurrence.",
    "last_action": "Referred to Committee for Courts of Justice",
    "last_action_date": "1/7/2026",
    "patron": "Griffin",
    "history": [
      {
        "date": "1/7/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26100172D"
      },
      {
        "date": "1/7/2026",
        "description": "H Referred to Committee for Courts of Justice"
      }
    ]
  },
  "HB379": {
    "bill_number": "HB379",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB379",
    "status": "In Committee",
    "summary": "Virginia Residential Landlord and Tenant Act; application;  notice, deposit, fee, and additional information. Provides that, prior to  requesting or collecting any payment or information about a prospective tenant,  a landlord shall first notify the prospective tenant in writing or by posting  in a manner accessible to a prospective tenant certain information relating to  the rental application process. The bill provides that a landlord shall use the  information contained in an application to evaluate an applicant for  eligibility for all dwelling units that the landlord owns in the Commonwealth,  and if a landlord fails to review an application for any reason, the landlord  shall refund any application fee paid by or on behalf of the applicant. The  bill also provides that if a landlord takes adverse action against an applicant  as defined in the bill, the landlord shall provide the applicant with a written  notice stating the reasons for the adverse action and a copy of any consumer  reports on which the landlord relied in whole or in part in making his  determination.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/12/2026",
    "patron": "Bennett-Parker",
    "history": [
      {
        "date": "1/12/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26102263D"
      }
    ]
  },
  "HB494": {
    "bill_number": "HB494",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB494",
    "status": "In Committee",
    "summary": "Virginia Personnel Act; hiring preference in state  government; certain former federal employees. Establishes a hiring  preference in state government for any person who has been terminated from a position of employment with  the federal government on or after April 1, 2025, due to a reduction in the  federal budget, initiatives put in place by the federal Department of  Government Efficiency, or any other effort deemed unrelated to a violation in  the workplace, workplace performance, or a dereliction of duty, provided that  such person meets all of the knowledge, skill, and ability requirements for the  available position. The bill defines the term  'preference' as requiring that a person who has been terminated from  a position of employment with the federal government be hired over a person who  has not been terminated from a position of employment with the federal  government when the two individuals are substantially equal in qualifications  for an eligible position. The bill sunsets on  January 21, 2029.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/12/2026",
    "patron": "Guzman",
    "history": [
      {
        "date": "1/12/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26102456D"
      }
    ]
  },
  "HB9": {
    "bill_number": "HB9",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB9",
    "status": "In Committee",
    "summary": "Time zone; permanent daylight saving time in the  Commonwealth. Provides that the Commonwealth shall observe Eastern Daylight  Time (Eastern Standard Time, advanced one hour) year-round upon the enactment  by Congress of a law allowing states to observe Eastern Daylight Time  year-round.",
    "last_action": "Referred to Committee on Rules",
    "last_action_date": "12/19/2025",
    "patron": "McNamara",
    "history": [
      {
        "date": "12/19/2025",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26101668D"
      },
      {
        "date": "12/19/2025",
        "description": "H Referred to Committee on Rules"
      }
    ]
  },
  "SB200": {
    "bill_number": "SB200",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/SB200",
    "status": "In Committee",
    "summary": "Board of Education; Standards of Learning assessments and  related assessment methods; development, administration, scoring, and release. Makes  several clarifying revisions to applicable law relating to the development,  administration, and scoring of Standards of Learning assessments and related  assessment methods for determining the level of achievement of Standards of  Learning objectives by all students. First, the bill clarifies that students  who are children with disabilities, as that term is defined by applicable law,  who participate in alternative methods of Standards of Learning assessment  administration or in alternate assessments through the Virginia Alternate  Assessment Program are exempt from several requirements set forth in applicable  law relating to the administration and grading of Standards of Learning  assessments and related assessments. The bill also repeals the provisions  requiring the Board of Education (the Board) to  establish a through-year growth assessment system in lieu of a one-time  end-of-year assessment.  The bill also specifies the requirements for local alternative  assessments, including permissive local alternative assessments and mandatory  local alternative assessments administered pursuant to applicable law, by (i)  requiring each school board to ensure that (a) each such assessment consists  only of prompts or assessment items to which no student had access prior to the  assessment's administration and (b) any teacher participating in grading any  such assessment does not grade any assessment completed by a student that such  teacher taught in a class or subject area that school year; (ii) directing the  Board of Education to develop and make available to each school board by  September 1, 2026, best practices for grading and scoring such local  alternative assessments; and (iii) directing the Board to perform an annual  audit of a certain percentage of any mandatory local alternative assessments  implemented by the school board, consistent with the procedures and requirements  set forth in the bill. The bill also requires the Board to make available to  each school division each Standards of Learning assessment administered the  previous school year, subject to the requirements and limitations set forth in  the bill.  The provisions of the bill limiting the number of  end-of-course assessments that may be administered to students in grades seven  through 12 and requiring the score received by each student in grades seven  through 12 on an end-of-course assessment to account for at least 10 percent of  the student's final grade in such course have a delayed effective date of the  date on which a contract is awarded to an assessment vendor for the new  statewide assessment system, pursuant to applicable law, as certified by the Department  of Education.",
    "last_action": "Referred to Committee on Education and Health",
    "last_action_date": "1/9/2026",
    "patron": "VanValkenburg",
    "history": [
      {
        "date": "1/9/2026",
        "description": "S Prefiled and ordered printed; Offered 01-14-2026 26104348D"
      },
      {
        "date": "1/9/2026",
        "description": "S Referred to Committee on Education and Health"
      }
    ]
  },
  "SB33": {
    "bill_number": "SB33",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/SB33",
    "status": "Pending",
    "summary": "Programs for at-risk students; permissible uses of funding. Includes as covered programs that are eligible for funding under the At-Risk Program initiatives to support both the physical and mental health of students in public schools, including the hiring of registered nurses and advanced practice registered nurses. The bill is a recommendation of the School Health Services Committee.",
    "last_action": "Assigned Education sub: Public Education",
    "last_action_date": "1/15/2026",
    "patron": "Favola",
    "history": [
      {
        "date": "11/19/2025",
        "description": "S Prefiled and ordered printed; Offered 01-14-2026 26100144D"
      },
      {
        "date": "11/19/2025",
        "description": "S Referred to Committee on Education and Health"
      },
      {
        "date": "1/15/2026",
        "description": "S Assigned Education sub: Public Education"
      }
    ]
  }
}