{
  "HB1161": {
    "bill_number": "HB1161",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB1161",
    "status": "In Committee",
    "summary": "Government Data Collection and Dissemination Practices Act;  dissemination of personal information to federal government; civil penalties.  Provides that any agency or political subdivision of the Commonwealth shall only  disseminate personal information (i) to the extent necessary to comply with  state or federal law, including the federal Health Insurance Portability and  Accountability Act; (ii) to the extent necessary to carry out the  administration of a state or federal program pursuant to state or federal law;  (iii) to comply with a subpoena, court order, or administrative proceeding;  (iv) to the extent necessary to ensure fulfillment of the obligations of a  purchase or contract made in accordance with the Virginia Public Procurement  Act; or (v) when the data subject has given consent. The bill authorizes a  court, in the case of a willful and knowing violation, to subject a specific  public officer, appointee, or employee of any agency to civil penalties.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/14/2026",
    "patron": "Tran",
    "history": [
      {
        "date": "1/14/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26105209D"
      }
    ]
  },
  "HB126": {
    "bill_number": "HB126",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB126",
    "status": "Pending",
    "summary": "Local, regional, and community correctional facilities;  access to counsel for inmates. Requires the State Board of Local and  Regional Jails to establish additional standards no later than January 1, 2027,  to ensure access to legal counsel for inmates held in any local, regional, or  community correctional facility and enumerates the standards that the Board  shall include in such additional standards.",
    "last_action": "Assigned HMPPS sub: Subcommittee #2",
    "last_action_date": "1/16/2026",
    "patron": "Callsen",
    "history": [
      {
        "date": "1/2/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26101260D"
      },
      {
        "date": "1/2/2026",
        "description": "H Referred to Committee on Public Safety"
      },
      {
        "date": "1/16/2026",
        "description": "H Assigned HMPPS sub: Subcommittee #2"
      }
    ]
  },
  "HB1260": {
    "bill_number": "HB1260",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB1260",
    "status": "In Committee",
    "summary": "Public elementary and secondary schools and public  institutions of higher education; certain federal immigration investigation and  enforcement activities; certain notifications and prohibitions. Requires, no  later than July 1, 2027, and subject to certain enumerated conditions and  requirements, (i) the written school crisis,  emergency management, and medical emergency response plan for each public  elementary or secondary school to include (a) a requirement  that whenever the division superintendent confirms that an individual is  present on the property of a public elementary or secondary school in the  school division to investigate compliance with, enforce, or assist in the  investigation for compliance with or enforcement of any federal civil  immigration law or any federal criminal immigration law that penalizes an  individual's presence in, entry or reentry into, or employment in the United  States, each school board employee at such school and the parents of each  student enrolled in such school shall be notified of such presence and (b) a  prohibition against any individual present on the property of a public  elementary or secondary school in the school division to investigate compliance  with, enforce, or assist in the investigation for compliance with or  enforcement of any federal civil immigration law or any federal criminal  immigration law that penalizes an individual's presence in, entry or reentry  into, or employment in the United States from accessing any nonpublic area of  such school property without a warrant signed by a judge or magistrate and (ii) each public institution of higher education to  (a) notify all students, faculty, and staff whenever the  institution confirms that an individual is present on campus to investigate  compliance with, enforce, or assist in the investigation for compliance with or  enforcement of any federal civil immigration law or any federal criminal  immigration law that penalizes an individual's presence in, entry or reentry into,  or employment in the United States and (b) prohibit  any individual present on campus to investigate compliance with, enforce, or  assist in the investigation for compliance with or enforcement of any federal  civil immigration law or any federal criminal immigration law that penalizes an  individual's presence in, entry or reentry into, or employment in the United  States from accessing any nonpublic area of campus without a warrant signed by  a judge or magistrate.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/14/2026",
    "patron": "Shin",
    "history": [
      {
        "date": "1/14/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26104922D"
      }
    ]
  },
  "HB1264": {
    "bill_number": "HB1264",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB1264",
    "status": "In Committee",
    "summary": "Virginia Accountability Commission established. Creates  the Virginia Accountability Commission (the Commission).  The Commission shall (i) create a public record of the conduct of federal  agents and any federal military-style operations throughout the Commonwealth,  (ii) examine the impact of that conduct on individuals and communities, and  (iii) consider policy recommendations to prevent future harms to these  individuals and communities. The bill requires the Commission to provide, not  later than January 31, 2027, an initial status report outlining its findings  and recommendations to the Governor, and not later than April 30, 2027, any  supplementary reports the Commission deems appropriate. The bill provides that  the Commission shall be composed of a chair, vice-chair,  and up to seven additional members, for a total membership of up to nine  uncompensated members, as appointed by the Governor, the House of Delegates,  and the Senate. The bill also provides that the term of each Commission member  shall expire one year from the date of his  appointment, and Commissioners may be reappointed or replaced at the pleasure  of the appointing authority. Finally, the bill requires the Office of Civil  Rights with the Office of the Attorney General to provide administrative and  professional staff support to the operations of the Commission. The Commission  may also work with subject matter experts and non-profit organizations as it  deems appropriate.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/14/2026",
    "patron": "Shin",
    "history": [
      {
        "date": "1/14/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26105283D"
      }
    ]
  },
  "HB1265": {
    "bill_number": "HB1265",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB1265",
    "status": "In Committee",
    "summary": "Certain civil arrests prohibited in  courthouses; penalty. Provides that a party who is required to attend any  court of the Commonwealth, or such party's family or household member or person  attending the court with such party to serve as a witness, shall be privileged  from civil arrest, defined in the bill, while attending, going to, or coming  from the court. The bill also prohibits a person with the lawful authority to  perform civil arrests from entering a courthouse to conduct a civil arrest  unless he complies with certain requirements, including presenting a judicial  warrant or judicial order authorizing the civil arrest to the appropriate  courthouse officer or employee. Additionally, the bill requires that any  judicial warrant or judicial order authorizing the civil arrest be reviewed by  a designated judicial officer or attorney before a civil arrest pursuant to  such warrant or order can be performed. Finally, the bill provides that any  person who conducts a civil arrest, or facilitates or assists with the  performance of, a civil arrest in violation of the provisions of the bill shall  be punished with contempt of court.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/14/2026",
    "patron": "Glass",
    "history": [
      {
        "date": "1/14/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26103200D"
      }
    ]
  },
  "HB650": {
    "bill_number": "HB650",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB650",
    "status": "In Committee",
    "summary": "Certain civil arrests prohibited in  courthouses; penalty. Provides that a party who is required to attend any  court of the Commonwealth, or such party's family or household member or person  attending the court with such party to serve as a witness, shall be privileged  from civil arrest, defined in the bill, while attending, going to, or coming  from the court. The bill also prohibits a person with the lawful authority to  perform civil arrests from entering a courthouse to conduct a civil arrest  unless he complies with certain requirements, including presenting a judicial  warrant or judicial order authorizing the civil arrest to the appropriate  courthouse officer or employee. Additionally, the bill requires that any  judicial warrant or judicial order authorizing the civil arrest be reviewed by  a designated judicial officer or attorney before a civil arrest pursuant to  such warrant or order can be performed. Finally, the bill provides that any  person who conducts a civil arrest, or facilitates or assists with the  performance of, a civil arrest in violation of the provisions of the bill shall  be punished with contempt of court.",
    "last_action": "Referred to Committee for Courts of Justice",
    "last_action_date": "1/13/2026",
    "patron": "Callsen",
    "history": [
      {
        "date": "1/13/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26105002D"
      },
      {
        "date": "1/13/2026",
        "description": "H Referred to Committee for Courts of Justice"
      }
    ]
  },
  "HB667": {
    "bill_number": "HB667",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB667",
    "status": "In Committee",
    "summary": "Juvenile and domestic relations district courts;  jurisdiction; definitions; petition by noncitizen aged 18 to 21 years for legal  custody and other relief. Allows an unmarried noncitizen between the ages  of 18 and 21 to petition a juvenile and domestic relations district court to be  placed in the custody of a proposed legal custodian and to receive services to  address the impacts of prior abuse, neglect, or abandonment that occurred  before such noncitizen reached 18 years of age. The bill  also includes such unmarried noncitizen in the definitions of  'child,' 'juvenile,' and 'minor,' as such terms  are related to juvenile and domestic relations district courts. The bill also  directs the Office of the Executive Secretary of the Supreme Court of Virginia  to develop and publish a form for such petition.",
    "last_action": "Referred to Committee for Courts of Justice",
    "last_action_date": "1/13/2026",
    "patron": "Maldonado",
    "history": [
      {
        "date": "1/13/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26104483D"
      },
      {
        "date": "1/13/2026",
        "description": "H Referred to Committee for Courts of Justice"
      }
    ]
  },
  "HB7": {
    "bill_number": "HB7",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB7",
    "status": "Pending",
    "summary": "Law-enforcement officers; restrictions  on wearing of facial coverings; exceptions; civil liability; penalty. Prohibits  certain state and federal law-enforcement officers from wearing facial  coverings, defined in the bill, while engaged in the performance of their  official duties. The bill sets out several exceptions to such prohibition,  including protective facial coverings to protect against disease, infection,  and exposure to toxic substances and facial coverings worn  by any law-enforcement officer assigned to a special weapons and tactics  team while engaged in the performance of his official duties with such team.  The bill subjects the law-enforcement officer to  disciplinary action, including dismissal, demotion, suspension, transfer, or  decertification, and creates a Class 1 misdemeanor for any  law-enforcement officer who wears a facial covering in violation of the  provisions of the bill unless the law-enforcement agency that employs such  law-enforcement officer has adopted and established a written policy for and  restrictions on the use of facial coverings. The  bill also directs the Department of Criminal Justice Services to develop a  model policy for and restrictions on the use of  facial coverings by law-enforcement officers.  Finally, the bill creates a civil cause of action for any  person injured as a result of tortious conduct by a law-enforcement officer who  knowingly and intentionally wears a facial covering in violation of the  provisions of the bill. The bill provides that sovereign immunity shall not be  a defense to civil liability for such tortious conduct.",
    "last_action": "Fiscal Impact Statement from Department of Planning and Budget (HB7)",
    "last_action_date": "1/19/2026",
    "patron": "Jones",
    "history": [
      {
        "date": "11/20/2025",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26101899D"
      },
      {
        "date": "11/20/2025",
        "description": "H Referred to Committee on Public Safety"
      },
      {
        "date": "1/19/2026",
        "description": "H Fiscal Impact Statement from Department of Planning and Budget (HB7)"
      },
      {
        "date": "1/16/2026",
        "description": "H Assigned HMPPS sub: Subcommittee #2"
      }
    ]
  },
  "HB879": {
    "bill_number": "HB879",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB879",
    "status": "In Committee",
    "summary": "Department of Social Services; requests for records or  information concerning applicants for and recipients of public assistance;  public notice required. Requires the Commissioner of Social Services or a local  director of social services to make a public notice available on the Department  of Social Services' website within 10 days of receiving a request for a record  or information concerning 25 or more applicants for or recipients of public  assistance or child support for a purpose not directly connected to the  administration of such programs. The bill establishes the form of such public  notice and requires such notice to be made available (i) regardless of whether  such information has been previously been shared; (ii) regardless of the  identity of the requestor, unless such request is permitted under existing law;  and (iii) even when a request is made in compliance with state and federal law  and regulation.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/13/2026",
    "patron": "Shin",
    "history": [
      {
        "date": "1/13/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26104792D"
      }
    ]
  },
  "HB911": {
    "bill_number": "HB911",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB911",
    "status": "In Committee",
    "summary": "Limited-duration licenses, driver  privilege cards and permits, and identification privilege cards; expiration.  Extends the validity of limited-duration licenses, driver privilege cards and  permits, and identification privilege cards, other than REAL ID credentials, as  defined in the bill, and commercial driver's licenses and permits, to a period  of time consistent with the validity of (i) driver's licenses, which under  current law is a period not to exceed eight years or for a person age 75 or  older, a period not to exceed five years; (ii) permits, which under current law  is the period of time until a driver's license is issued or the person is no  longer eligible for such permit, a period of 12 months for motorcycle permits,  or a period of the 60 days prior to the person's first behind-the-wheel exam  for persons 25 years of age or older; and (iii) special identification cards,  which under current law is a period between three and eight years, with exceptions,  or for a person younger than the age of 15, until such person's sixteenth  birthday, unless extended under certain circumstances for a period no longer  than 90 days. The bill directs the Department of Motor Vehicles to implement  the extended validity periods for such documents upon reissuance.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/13/2026",
    "patron": "Lopez",
    "history": [
      {
        "date": "1/13/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26102215D"
      }
    ]
  },
  "HB912": {
    "bill_number": "HB912",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB912",
    "status": "In Committee",
    "summary": "Public schools; right to free public elementary and  secondary education; discrimination based on immigration status prohibited;  requirements; civil cause of action. Prohibits any child in the Commonwealth  from being denied a free public education through secondary school on the basis  of the actual or perceived immigration or citizenship status of the child or  the child's parents, in accordance with the Constitution of Virginia and  consistent with the requirements of the Fourteenth Amendment to the United  States Constitution. The bill prohibits any school board or public elementary  or secondary school from engaging in certain enumerated actions and practices  that involve or result in the denial of a free public education, or denial of  the benefits or exclusion from participation in any program or activity  thereof, of a child on the basis of the actual or perceived immigration or  citizenship status of the child or the child's parents. The bill also requires  each public elementary and secondary school to develop and implement procedures  for reviewing and authorizing requests from law enforcement agents to enter a  public school or public school facility. The bill establishes a civil cause of  action for any party aggrieved by conduct that violates the provisions of the  bill, in accordance with the provisions of the bill.   Finally, the bill directs (i) the Department of Education to  develop and make available to each school board by August 1, 2026, guidance for  school personnel on the requirements of the bill and training guidelines and  materials for the training of all public school principals and administrators  on compliance with the provisions of the bill, and (ii) each school board to  (a) develop and implement by August 1, 2026, policies and procedures in  accordance with the provisions of the bill and (b) require each public school  principal and administrator to complete training on compliance with the  provisions of the bill by the beginning of the 2026-2027 school year.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/13/2026",
    "patron": "Lopez",
    "history": [
      {
        "date": "1/13/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26102214D"
      }
    ]
  },
  "HB993": {
    "bill_number": "HB993",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/HB993",
    "status": "In Committee",
    "summary": "Driver privilege cards and permits; discontinued.  Discontinues the issuance of driver privilege cards and provides that any issued  driver privilege card is invalid as of July 1, 2026. The bill requires the Department  of Motor Vehicles to notify any person who has been issued a driver privilege card  that such driver privilege card is invalid.",
    "last_action": "Committee Referral Pending",
    "last_action_date": "1/13/2026",
    "patron": "Garrett",
    "history": [
      {
        "date": "1/13/2026",
        "description": "H Prefiled and ordered printed; Offered 01-14-2026 26102108D"
      }
    ]
  },
  "SB90": {
    "bill_number": "SB90",
    "bill_url": "https://lis.virginia.gov/bill-details/20261/SB90",
    "status": "Pending",
    "summary": "Public schools; Standards of Quality; certain calculations;  At-Risk Program established. The bill establishes (i) the At-Risk Program  for the purpose of supporting programs and services for students who are educationally  at-risk, including programs and services of prevention, intervention, or  remediation; (ii) a state-funded, flexible per pupil  Standards of Quality funding add-on to be applied for each special education  student, calculated in accordance with the provisions of the bill, for the  purpose of better meeting the educational needs of students with disabilities;  and (iii) a state-funded, flexible per-pupil  Standards of Quality funding add-on to be provided for each English language  learner student, calculated in accordance with the provisions of the bill, for  the purpose of better meeting the educational needs of English language learner  students. The bill also establishes requirements and conditions for each school  division receiving funding pursuant to the At-Risk Program or either of the per pupil Standards of Quality funding add-ons  established pursuant to the bill, including a requirement that each such school  division annually report to the Department of Education  on the planned and actual uses of such funds. The bill directs the Department  to annually compile and publish on its website a summary of the reports  received from each school division on the use of such funds. Finally, the bill  authorizes the Department, upon providing notice and an opportunity for  corrective action, withhold, recover, or redirect funds provided pursuant to  the bill from any school division found to be in noncompliance with the  requirements set forth in the bill.",
    "last_action": "Assigned Education sub: Public Education",
    "last_action_date": "1/15/2026",
    "patron": "Favola",
    "history": [
      {
        "date": "12/31/2025",
        "description": "S Prefiled and ordered printed; Offered 01-14-2026 26102657D"
      },
      {
        "date": "12/31/2025",
        "description": "S Referred to Committee on Education and Health"
      },
      {
        "date": "1/15/2026",
        "description": "S Assigned Education sub: Public Education"
      }
    ]
  }
}